# Pandas Exercises

This exercise is concerned with baby names in the US between the years 2000 and 2018. The exercise tasks include exploratory data analysis and some data visualization. With these exercises, you will get to practice with some of the most commonly used Pandas features for hand-on data analytics.

Data source: catalog.data.gov

Inspiration for this exercise: PhantomInsights@github

The data set is available as a CSV file named "baby_names_2000.csv" on GitHub [here](https://github.com/akmand/datasets).

## Exercise 1 

Place this CSV file under the same directory where your Jupyter Notebook file is. 

Import Pandas as "pd" and NumPy as "np". 

Read the data into a Pandas data frame called `df`.

In [2]:
import warnings
warnings.filterwarnings("ignore")

import pandas as pd
import numpy as np

import os, ssl
if (not os.environ.get('PYTHONHTTPSVERIFY', '') and
getattr(ssl, '_create_unverified_context', None)):
    ssl._create_default_https_context = ssl._create_unverified_context

import io, requests
names_url = 'https://raw.githubusercontent.com/akmand/datasets/master/baby_names_2000.csv'
url_content = requests.get(names_url).content
df = pd.read_csv(io.StringIO(url_content.decode('utf-8')))

## Exercise 2

How many rows are there in this dataset?

In [3]:
df.shape[0]

624236

## Exercise 3

How many columns does this dataset have?

In [4]:
df.shape[1]

4

## Exercise 4

What are the names of columns in this dataset? Format the output as a Python list, please.

**Hint:** Use the `columns` attribute of `df` and cast the result to a Python list.

In [34]:
list(df.columns.values)

['year', 'name', 'gender', 'count']

## Exercise 5

Display the first 10 rows.

In [35]:
df.head(10)

   year       name gender  count
0  2000      Emily      F  25956
1  2000     Hannah      F  23082
2  2000    Madison      F  19968
3  2000     Ashley      F  17997
4  2000      Sarah      F  17702
5  2000     Alexis      F  17629
6  2000   Samantha      F  17265
7  2000    Jessica      F  15709
8  2000  Elizabeth      F  15099
9  2000     Taylor      F  15078

## Exercise 6

Display the last 10 rows.

In [36]:
df.tail(10)

        year    name gender  count
624226  2018   Zuber      M      5
624227  2018  Zubeyr      M      5
624228  2018   Zyell      M      5
624229  2018  Zyheem      M      5
624230  2018  Zykeem      M      5
624231  2018   Zylas      M      5
624232  2018   Zyran      M      5
624233  2018   Zyrie      M      5
624234  2018   Zyron      M      5
624235  2018   Zzyzx      M      5

## Exercise 7

Replace the gender "M" with "B" for boy, and "F" with "G" for girl.

In [41]:
df['gender'] = df['gender'].replace({'M': 'B', 'F': 'G'})

## Exercise 8 
What is the earliest year?

In [44]:
min(df['year'])

2000

## Exercise 9

What is the most recent year?

In [45]:
max(df['year'])

2018

## Exercise 10

How many unique names are there regardless of gender?

**Hint:** Use the `nunique()` function.

## Exercise 11

How many unique names for boys?

## Exercise 12 

How many unique names for girls?

# Optional Exercises

## Exercise 13

The *gender* variable is categorical with two levels: *B, G*. You will now define a new data frame called `pivot_df` by "spreading" these two values into two columns where the cell values will be the sum of all the counts over all the years. You need to have a unique name in each row. To be clear, your new data frame needs to have exactly three columns: *name, B, G*. This is called a **pivot table**. Once you define your new data frame, display the top 5 rows.

**Hint:** For this, you will need to use the `pivot_table()` function with the `np.sum` aggregation. In particular, you will need to run the line below.
```Python
pivot_df = df.pivot_table(index = 'name', columns = 'gender', values = 'count', aggfunc = np.sum)
```
After that, you will need to run the `dropna()` and `reset_index()` functions.

**Bonus:** Get rid of the columns' name on the top left corner. That is, set the data frame's columns' `name` attribute to "None".

**Illustration**


| name	| B	| G | 
|-------|---|---|
| Aaden	|4828.0| 5.0|
| Aadi |851. |16.0 |

## Exercise 14 

How many unique names are there that are gender-neutral (that is, names used for both boys and girls)? For more meaningful results, use names where both boy and girl counts are at least 1000.

**Hint:** Use your new pivot table from above and assign the query result to back to `pivot_df`.

## Exercise 15


For the pivot table, define a new column *Total* which is the sum of boy and girl name counts for each name. Set the new column's data type to an integer using the `astype()` function with the `int` option. Then display 10 randomly selected rows.

## Exercise 16

What are the top 10 boy names?

**Hint:** First filter for boys in the `df` data frame (not `pivot_df`). Then use the `groupby()` function on the *names* column followed by the `sum()` function. 

Keep in mind that when an aggregation function such as `sum()` is called an a `groupby` object, it is applied to each group separately. 

Next, sort the resulting data frame by the *count* column in a descending order and finally get the top 10 rows.

## Exercise 17

How about the top 10 girl names?

## Exercise 18

How about the top 10 gender-neutral names (after filtering for low-count names)?

**Hint**: Use the `pivot_df` data frame and sort it.

## Exercise 19 (Matplotlib)

Plot the number of baby boys and baby girls on the same plot as a function of years. The y-axis should be the number of babies and the x-axis should be the year. Make sure you have a meaningful title, correct x and y axis labels, and also a legend.

**Hint:** Define two new data frames using `df`, one for boys and one for girls. For each data frame, first group by the *year* variable and then use the `sum()` function. This will give you data frames with two columns each: `year` and `count`. You can directly pass these data frames into the `plot()` function. Make sure you define 'Boy' and 'Girl' plot labels for the `plot()` function calls. Use blue color for boys and red color for girls. Use a line width of 2 for both using the `lw` option.

## Exercise 20 (Matplotlib)

We are now interested in two cute baby names: Emma and Emily. Plot the number of baby girls (that is, boys excluded) with these names on the same plot as a function of time as two separate lines. The y-axis should be the number of babies and the x-axis should be the year. Make sure you have a meaningful title, correct x and y labels, and also a legend.

Which name seems to maintain its popularity over the years and which name seems to lose it?

***
www.featureranking.com